[
  "Nervos is a layered crypto-economy network.",
  "Nervos separates the infrastructure of a crypto-economy into two: layer 1, the verification layer, ensures trust and custody, while layer 2, the generation layer, facilitates fast transactions and privacy.",
  "Our mission is to establish a peer-to-peer crypto-economy network that incentivizes collaboration.",
  "Nervos CKB is a layer 1 blockchain, a decentralized and secure layer that provides common knowledge custody for the network.",
  "Common knowledge refers to states that are verified by global consensus.",
  "Crypto-assets exemplify common knowledge because their ownership and transaction history are validated through network consensus.",
  "In Nervos, the CKB and all layer 2 protocols work together to serve the crypto-economy.",
  "CKB (layer 1) is responsible for storing and defining the state. Layer 2, aka the generation layer or computation layer, processes most transactions and generates new states.",
  "CKB combines Proof-of-Work based consensus, a RISC-V based virtual machine, a state model based cell model, a state-oriented economic model, and a robust peer-to-peer network.",
  "The Proof-of-Work based consensus makes CKB a public and censorship-resistant service.",
  "CKB-VM and the Cell model together create a stateful Turing-complete programming model, empowering developers to effectively generate state or build layer 2 solutions on CKB.",
  "The CKB programming model consists of three parts: state generation (Off-chain), state verification (CKB-VM), and state storage (Cell model).",
  "The CKB economic model is designed for common knowledge custody and long-term sustainability.",
  "The CKB peer-to-peer network provides secure and optimal communication among various types of nodes.",
  "CKB consensus improves Nakamoto Proof-of-Work consensus, ensuring openness, correctness, and high performance in distributed environments, while considering network delays and Byzantine node faults.",
  "CKB consensus, a Nakamoto consensus variant, provides an open network where nodes can freely join, leave, and participate in consensus by mining new blocks or verifying them.",
  "CKB employs an ASIC-neutral Proof-of-Work function to achieve two primary goals: evenly distributing tokens and maximizing network security.",
  "CKB’s layered architecture separates state and computation, making each layer more flexible and scalable.",
  "CKB transactions have an inputs/outputs based structure like Bitcoin.",
  "Scripts running in CKB-VM are pure functions with no internal state, making CKB scripts deterministic, conducive to parallel execution, and easy to compose.",
  "Cells are the primary state units in CKB.",
  "A cell is an immutable object, no one can modify it after creation.",
  "Every cell can only be used once, it cannot be used as input for two different transactions.",
  "In CKB-VM, there are no hardcoded cryptographic primitives. Users have the freedom to choose any cryptographic signature scheme they prefer to sign transactions.",
  "The Cell model is a more generic state model compared to the UTXO or Account model.",
  "CKB implements cryptographic primitives as ordinary assembly running on its RISC-V instruction set based VM.",
  "CKB-VM is a crypto-agnostic virtual machine.",
  "CKB is crypto-agnostic, allowing DApp developers to freely build with any cryptographic algorithms of their choice.",
  "CKB transactions have no hardcoded payment method. Users can use any user-defined assets accepted by miners.",
  "The CKB economic model is designed to motivate users, developers, and node operators to collaborate for the goal of common knowledge custody.", 
  "CKB economic model focuses on state instead of computation, using cell capacity and transaction fees as incentives for stakeholders.",
  "CKB's economic model promotes a decentralized network by maintaining manageable resource requirements for full nodes and low barriers to entry, allowing a diverse set of service providers to support lightweight nodes.",
  "In CKB, cell owners have the ability to pay fees on behalf of their users, and payment can be made using any user-defined assets.",
  "Nervos is a common knowledge custody network where states are verified by global consensus and stored in a highly available peer-to-peer network.",
  "Our imagination is the only bounds of CKB."
]
